# 招聘网站：
# 智联、猎聘
# 前程无忧
# boss
# 拉钩
# 朋友推荐

# 爬虫简历
# 掌握xxxxx
# 源码阅读经验
# 了解Django、flask、tornado框架
# 了解数据分析、数据处理等相关操作
# 了解常用的机器学习算法
# 了解常用的卷积神经网络算法

# 后端
# 掌握xxxxx
# 了解数据分析、数据处理等相关操作
# 了解常用的机器学习算法
# 了解常用的卷积神经网络算法

# 数据分析/挖掘 简历
# 掌握Python编程语法
# 掌握网络套接字、面向对象思想、Python三大器
# 熟练使用mysql、oracle、splite、monogodb、redis、db等数据库
# 掌握常用的数据结构与算法
# 能够使用Python进行数据的相关科学计算
# 能够使用Python进行缺失值处理、异常值处理、标准化处理、数据变换、二值化处理等数据处理操作
# 能够使用matplotlib、pyecharts进行数据可视化
# 熟练使用excel、powerbi、tableau、spss等数据分析常用软件
# 理解常用的机器学习算法原理、特点、优化思路，并能够建立模型进行预测
# 了解常用的神经网络相关算法
# 了解Django、flask等后端框架
# 了解爬虫.....

# hadoop、spark、hive、etl ....

# 机器学习
# 理解机器学习算法原理、特点、优化思路，并能够建立模型进行预测
# 掌握xxxx神经网络、yyyy神经网络、hhhh神经网络原理、特点、参数优化，并能够利用这些网络干什么事
# 再加上自己的其他优势
# 能够手推算法原理

# 深度学习（图像领域、语音领域、智能驾驶领域、自然语言处理....）
# pass


# SVM --支持向量机
# GBDT --梯度提升树
# XGBOOST
#

# xxxxx科技有限公司  17---20--  数据挖掘工程师

# 项目名称：9527项目
# 项目介绍：
# 项目平台：windows、mysql、

# 项目功能：
# 数据获取模块
# 数据处理模块
# 指标计算模块
# 算法模块
# 可视化模块
# 输出报告


# 复习：从后往前复习

